[
  {
    "title": "From Sketch to Screen",
    "stakeholder": {
      "name": "Rahad Arman Nabid",
      "email": "rahad.arman.nabid@temple.edu"
    },
    "description": "A collaborative UI design tool tailored for non-programmers. It allows multiple users to sketch interfaces, render designs in real time, finalize CSS, and specify page interactions—all without needing coding skills.",
    "category": "Design Tools"
  },
  {
    "title": "Collaborative Agent",
    "stakeholder": {
      "name": "Rahad Arman Nabid",
      "email": "rahad.arman.nabid@temple.edu"
    },
    "description": "An AI-powered system to support student programming teams. It helps form teams, allocate tasks, enable simultaneous coding, provide real-time feedback, and suggest improvements based on peer reviews.",
    "category": "AI & Education"
  },
  {
    "title": "AAC API",
    "stakeholder": {
      "name": "Cindy Zastidil",
      "email": "cynthia.zastudil@temple.edu"
    },
    "description": "Games where augmentative and alternative communication (AAC) devices are used as controllers for the game is promising for increasing social inclusion of children who use these devices, such as minimally verbal autistic children. We want to build out an API which supports audio-controlled games where the output from an AAC device is automatically converted into game actions.",
    "category": "Accessibility & Gaming"
  },
  {
    "title": "Predictive Anchoring",
    "stakeholder": {
      "name": "Cindy Zastidil",
      "email": "cynthia.zastudil@temple.edu"
    },
    "description": "Predictive anchoring is a conceptual design which makes grid displays, a kind of high-tech AAC device, more learnable and quicker to use by leveraging techniques that people use to learn language. Word predictions are provided on a word or folder of words to anchor the suggestions to words they are related to. This technique may make it easier for users of grid displays to communicate quicker and develop more advanced language skills.",
    "category": "Accessibility"
  },
  {
    "title": "Highlighting",
    "stakeholder": {
      "name": "Cindy Zastidil",
      "email": "cynthia.zastudil@temple.edu"
    },
    "description": "Just as smartphone users are provided with intelligent text prediction when they are composing text messages, we want to enable that functionality in AAC devices. By using different levels of opacity we can direct users' attention to the words which may be of the most interest to them.",
    "category": "Accessibility"
  }
]

